In [1]:
import pandas as pd
import numpy as np

- Differences between loc and iloc

**loc** is label-based, which means that you have to specify rows and columns based on their row and column labels.

**iloc** is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

![check this link to no more things](https://miro.medium.com/max/1000/1*CgAWzayEQY8PQuMpRkSGfQ.png)

### Series

In [3]:
## Create empty series
emty_series = pd.Series()
emty_series

<ipython-input-3-cdb95c20920a>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  emty_series = pd.Series()

Series([], dtype: float64)

In [20]:
## Use List to create List
lst =  [20,30,40,50]
lst_series= pd.Series(lst)

In [21]:
lst_series

0    20
1    30
2    40
3    50
dtype: int64

In [22]:
## access data
lst_series[0:2]

0    20
1    30
dtype: int64

In [23]:
## access data
lst_series[2:]

2    40
3    50
dtype: int64

In [24]:
## Retrive first three element
## access data
lst_series[:3]

0    20
1    30
2    40
dtype: int64

In [28]:
## With Index
lst_series= pd.Series(lst,index=["A","B","C","D"])
lst_series

A    20
B    30
C    40
D    50
dtype: int64

In [33]:
## retrive single Index
lst_series["A"]

20

In [32]:
## retirve multiple Emelements
lst_series[["A","B","C"]] ## put into the list

A    20
B    30
C    40
dtype: int64

In [9]:
# Dtypes and Index 
lst_series= pd.Series(lst,index=["A","B","C","D"],dtype='Int32')
lst_series

A    20
B    30
C    40
D    50
dtype: Int32

In [12]:
## Create Dictinoary
dict_  = {"Name": "john","Age":30}
dict_series = pd.Series(dict_)

In [13]:
dict_series

Name    john
Age       30
dtype: object

In [16]:
## Create Dictinoary
dict_  = {"Name": "john","Age":30}
dict_series2 = pd.Series(dict_,index=["Name","Age"])

In [17]:
dict_series2

Name    john
Age       30
dtype: object

In [18]:
## Create numpy array

create_array = np.array([23,4,5,6,6])
create_array_series = pd.Series(create_array)

In [19]:
create_array_series

0    23
1     4
2     5
3     6
4     6
dtype: int32

### DATA FRAME

In [36]:
## Create empty Dataframe
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [43]:
## using List to bind with data frame
lst_= [12,45,5,67,67,78,87,8,8]
df_list = pd.DataFrame(lst_,columns=["A"])
df_list

    A
0  12
1  45
2   5
3  67
4  67
5  78
6  87
7   8
8   8

In [47]:
df_list[0:3]

    A
0  12
1  45
2   5

In [48]:
## Numpy 
np_array = np.array([23,34,4,5],[23,34,4,5])
numpy_lst = pd.DataFrame()

    0
0  23
1  34
2   4
3   5
4   6

In [53]:
## list of list
lst_of_lst = [[23,34,4,5],[23,34,4,5]]
numpy_lst = pd.DataFrame(lst_of_lst,index=["A","B"],columns= ["Name","Age","name","age"])
numpy_lst

   Name  Age  name  age
A    23   34     4    5
B    23   34     4    5

In [55]:
## list of dictionary
lst_of_dict = [{23,34,4,5},{23,34,4,5}]
numpy_lst = pd.DataFrame(lst_of_dict)
lst_of_dict

[{4, 5, 23, 34}, {4, 5, 23, 34}]

In [59]:
## DataFrame from Dict
dict_values = {"name":["Ray","bob"], "age":[34,23],"location":["Mumbai","Pune"]}
df_dict = pd.DataFrame(dict_values)
df_dict

  name  age location
0  Ray   34   Mumbai
1  bob   23     Pune

In [61]:
df_dict.dtypes

name        object
age          int64
location    object
dtype: object

In [62]:
df_dict.head()

  name  age location
0  Ray   34   Mumbai
1  bob   23     Pune

In [63]:
df_dict.tail()

  name  age location
0  Ray   34   Mumbai
1  bob   23     Pune

In [72]:
df_dict.columns

Index(['name', 'age', 'location'], dtype='object')

In [73]:
df_dict.index

RangeIndex(start=0, stop=2, step=1)

In [74]:
df_dict.to_numpy()

array([['Ray', 34, 'Mumbai'],
       ['bob', 23, 'Pune']], dtype=object)

In [76]:
df_dict.describe

<bound method NDFrame.describe of   name  age location
0  Ray   34   Mumbai
1  bob   23     Pune>

In [80]:
df_dict.sort_values(by="name")

  name  age location
0  Ray   34   Mumbai
1  bob   23     Pune

In [84]:
df = df_dict + df_dict

In [85]:
df

     name  age      location
0  RayRay   68  MumbaiMumbai
1  bobbob   46      PunePune

In [87]:
## drop the row
df_dict.drop(0)

  name  age location
1  bob   23     Pune

In [94]:
## loc
df_dict.loc[:, ["name", "age"]]

  name  age
0  Ray   34
1  bob   23

In [97]:
# Boolean indexing
df_dict[df_dict["age"] > 30]

  name  age location
0  Ray   34   Mumbai

In [102]:
## series
series_lst = pd.DataFrame(pd.Series([23,45,5,6]))
series_lst

    0
0  23
1  45
2   5
3   6